module simpletest

language Prolog

test very simple [[
	cat(tom) :- true.
	
	?- cat(tom).
]] run evaluate-full to Result("true", [])

test simple wildcard [[
	a(_X, _) :- b(_X).
	b(1).
	
	?- a(Y, Z).
]] run evaluate-full to Result("true", [Binding("Y", Int("1")), Unbounded("Z")])

test simple local binding [[
	a(X).
	
	?- a(b).
]] run evaluate-full to Result("true", [])

test simple free binding [[
	a(b).
	
	?- a(X).
]] run evaluate-full to Result("true", [Binding("X", Atom("b"))])

test bad mixed local and free variables [[
	a(F1, F1, F2) :- b(F1, F2).
	b(1,2).
	
	?- a(G1, G2, G2).
]] run evaluate-full to Result("false", _) // false