module twowaybindings

language Prolog

test single two way [[
	a(Z) :- b(Z).
	b(c).

	?- a(X).
]] run evaluate-full to Result("true", [Binding("X", Atom("c"))])

test multiple two way [[
	a(X, Y) :- b(X), c(Y).
	b(1).
	c(2).
	
	?- a(Z1, Z2).
]] run evaluate-full to Result("true", [Binding("Z1", Int("1")), Binding("Z2", Int("2"))])

test same local variable [[
	a(X, X).
	
	?- a(Y, b).
]] run evaluate-full to Result("true", [Binding("Y", Atom("b"))])

test same local variable reversed [[
	a(X, X).
	
	?- a(b, Y).
]] run evaluate-full to Result("true", [Binding("Y", Atom("b"))])

test same local variable resolved later [[
	a(X, X) :- b(X).
	b(c).
	
	?- a(Y, Z).
]] run evaluate-full to Result("true", [Binding("Y", Atom("c")), Binding("Z", Atom("c"))])

test same free variable [[
	a(Y, b).
	
	?- a(X, X).
]] run evaluate-full to Result("true", [Binding("X", Atom("b"))])

test same free variable reversed [[
	a(b, Y).
	
	?- a(X, X).
]] run evaluate-full to Result("true", [Binding("X", Atom("b"))])

test same free variable resolved later [[
	a(Y, Z) :- b(Z, Y).
	b(1, 2).
	b(2, 1).
	b(2, 2).
	
	?- a(X, X).
]] run evaluate-full to Result("true", [Binding("X", Int("2"))])

test mixed same local and free variables [[
	a(F1, F1, F2) :- b(F1, F2).
	b(1, 2).
	b(2, 1).
	b(1, 1).
	
	?- a(G1, G2, G2).
]] run evaluate-full to Result("true", [Binding("G1", Int("1")), Binding("G2", Int("1"))])

test single inner binding [[
	a(b(Z)) :- c(Z).
	c(d).
	
	?- a(Y).
]] run evaluate-full to Result("true", [Binding("Y", CompoundTerm("b", [Atom("d")]))])

test single outer binding [[
	a(Z) :- c(Z).
	c(b(d)).
	
	?- a(b(Y)).
]] run evaluate-full to Result("true", [Binding("Y", Atom("d"))])

test same local inner variable [[
	a(b(Z), b(Z)).
	
	?- a(Y, b(1)).
]] run evaluate-full to Result("true", [Binding("Y", CompoundTerm("b", [Int("1")]))])

test same local inner variable reversed [[
	a(b(Z), b(Z)).
	
	?- a(b(1), Y).
]] run evaluate-full to Result("true", [Binding("Y", CompoundTerm("b", [Int("1")]))])

test same free inner variable [[
	a(b(1), b(Z)).
	
	?- a(Y, Y).
]] run evaluate-full to Result("true", [Binding("Y", CompoundTerm("b", [Int("1")]))])

test same free inner variable reversed [[
	a(b(Z), b(1)).
	
	?- a(Y, Y).
]] run evaluate-full to Result("true", [Binding("Y", CompoundTerm("b", [Int("1")]))])

test same local outer variable [[
	a(Z, Z).
	
	?- a(b(1), b(Y)).
]] run evaluate-full to Result("true", [Binding("Y", Int("1"))])

test same local outer variable reversed [[
	a(Z, Z).
	
	?- a(b(Y), b(1)).
]] run evaluate-full to Result("true", [Binding("Y", Int("1"))])

test same free outer variable [[
	a(b(1), Z).
	
	?- a(b(Y), b(Y)).
]] run evaluate-full to Result("true", [Binding("Y", Int("1"))])

test same free outer variable reversed [[
	a(Z, b(1)).
	
	?- a(b(Y), b(Y)).
]] run evaluate-full to Result("true", [Binding("Y", Int("1"))])